[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:34:14
           <Navbar.Toggle />
 
           <Nav className="me-auto">
-            {systemInfo?.springH2ConsoleEnabled && (
-              <Nav.Link href="/h2-console">H2Console</Nav.Link>
-            )}
+            {true}
             {systemInfo?.showSwaggerUILink && (
               <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Error: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:53:16
                   <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
                 </NavDropdown>
               )}
-              {currentUser && currentUser.loggedIn && (
-                <>
-                  <Nav.Link as={Link} to="/restaurants">
-                    Restaurants
-                  </Nav.Link>
-                  <Nav.Link as={Link} to="/ucsbdates">
-                    UCSB Dates
-                  </Nav.Link>
-                  <Nav.Link as={Link} to="/recommendationrequests">
-                    Recommendation Request
-                  </Nav.Link>
-                  <Nav.Link as={Link} to="/placeholder">
-                    Placeholder
-                  </Nav.Link>
-                  <Nav.Link as={Link} to="/diningcommonsmenuitem">
-                    UCSB Dining Commons Menu Items
-                  </Nav.Link>
-                  <Nav.Link as={Link} to="/articles">
-                    Articles
-                  </Nav.Link>
-                </>
-              )}
+              {currentUser && currentUser.loggedIn || <>
+                  <Nav.Link as={Link} to="/restaurants">
+                    Restaurants
+                  </Nav.Link>
+                  <Nav.Link as={Link} to="/ucsbdates">
+                    UCSB Dates
+                  </Nav.Link>
+                  <Nav.Link as={Link} to="/recommendationrequests">
+                    Recommendation Request
+                  </Nav.Link>
+                  <Nav.Link as={Link} to="/placeholder">
+                    Placeholder
+                  </Nav.Link>
+                  <Nav.Link as={Link} to="/diningcommonsmenuitem">
+                    UCSB Dining Commons Menu Items
+                  </Nav.Link>
+                  <Nav.Link as={Link} to="/articles">
+                    Articles
+                  </Nav.Link>
+                </>}
             </Nav>
 
killedBy: AppNavbar tests renders the ucsbdates link correctly
statusReason: Error: Unable to find an element with the text: UCSB Dates. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:53:16
                   <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
                 </NavDropdown>
               )}
-              {currentUser && currentUser.loggedIn && (
+              {currentUser || currentUser.loggedIn && (
                 <>
                   <Nav.Link as={Link} to="/restaurants">
killedBy: AppNavbar tests Restaurant and UCSBDates links do NOT show when not logged in
statusReason: TypeError: Cannot read properties of null (reading 'loggedIn')
