[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:77:23
           type="text"
           isInvalid={Boolean(errors.professorEmail)}
           {...register("professorEmail", {
-            required: "Professor Email is required.",
+            required: "",
             maxLength: {
               value: 255,
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Professor Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:116:41
           type="datetime-local"
           isInvalid={Boolean(errors.dateRequested)}
           step="1"
-          {...register("dateRequested", {
-            required: true,
-            pattern: isodate_regex,
-          })}
+          {...register("dateRequested", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Requested is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:133:24
           type="datetime-local"
           isInvalid={Boolean(errors.dateNeeded)}
           step="1"
-          {...register("dateNeeded", {
+          {...register("", {
             required: true,
             pattern: isodate_regex,
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:149:32
           id="done"
           as="select"
           isInvalid={Boolean(errors.done)}
-          {...register("done", {
-            required: "Done is required.",
-          })}
+          {...register("done", {})}
         >
           <option value="">---</option>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Done is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
