[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:54:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="requestorEmail">Requestor Email</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-requestorEmail"}
+          data-testid={testIdPrefix + ""}
           id="requestorEmail"
           type="text"
killedBy: RecommendationRequestCreatePage tests renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestForm-requestorEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:58:42
           id="requestorEmail"
           type="text"
           isInvalid={Boolean(errors.requestorEmail)}
-          {...register("requestorEmail", {
-            required: "Requestor Email is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-          })}
+          {...register("requestorEmail", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Requestor Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:58:24
           id="requestorEmail"
           type="text"
           isInvalid={Boolean(errors.requestorEmail)}
-          {...register("requestorEmail", {
+          {...register("", {
             required: "Requestor Email is required.",
             maxLength: {
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:59:23
           type="text"
           isInvalid={Boolean(errors.requestorEmail)}
           {...register("requestorEmail", {
-            required: "Requestor Email is required.",
+            required: "",
             maxLength: {
               value: 255,
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Requestor Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:60:24
           isInvalid={Boolean(errors.requestorEmail)}
           {...register("requestorEmail", {
             required: "Requestor Email is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: RecommendationRequestForm tests shows maxLength error when Requestor Email >255 chars
statusReason: Error: Unable to find an element with the text: /Max length 255 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/RecommendationRequests/RecommendationRequestForm.js:67:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.requestorEmail?.message}
+          {errors.requestorEmail.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:100:24
           isInvalid={Boolean(errors.explanation)}
           {...register("explanation", {
             required: "Explanation is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 255 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:155:23
           as="select"
           isInvalid={Boolean(errors.done)}
           {...register("done", {
-            required: "Done is required.",
+            required: "",
           })}
         >
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Done is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
