[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:15:18
 export default function RecommendationRequestTable({
   recommendationrequests,
   currentUser,
-  testIdPrefix = "RecommendationRequestTable",
+  testIdPrefix = "",
 }) {
   const navigate = useNavigate();
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/RecommendationRequests/RecommendationRequestTable.js:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/recommendationrequests/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: RecommendationRequestTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/recommendationrequests/edit/2"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:44:15
     },
 
     {
-      Header: "Requestor Email",
+      Header: "",
       accessor: "requestorEmail",
     },
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Requestor Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:49:17
     },
     {
       Header: "Professor Email",
-      accessor: "professorEmail",
+      accessor: "",
     },
     {
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-professorEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:56:15
       accessor: "explanation",
     },
     {
-      Header: "Date Requested",
+      Header: "",
       accessor: "dateRequested",
     },
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Date Requested. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:61:17
     },
     {
       Header: "Date Needed",
-      accessor: "dateNeeded",
+      accessor: "",
     },
     {
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-dateNeeded"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:64:15
       accessor: "dateNeeded",
     },
     {
-      Header: "Done",
+      Header: "",
       accessor: "done",
     },
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Done. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:65:17
     },
     {
       Header: "Done",
-      accessor: "done",
+      accessor: "",
     },
   ];
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-done"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
