[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/recommendationRequest/post",
-    method: "POST",
-    params: {
-      requestorEmail: recommendationRequest.requestorEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:8:59
 import { toast } from "react-toastify";
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/recommendationRequest/post",
-    method: "POST",
-    params: {
-      requestorEmail: recommendationRequest.requestorEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosParams = (recommendationRequest) => ({});
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:21:48
     },
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(
-      `New recommendationRequest Created - id: ${recommendationRequest.id} requestorEmail: ${recommendationRequest.requestorEmail}`,
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New recommendationRequest Created - id: 13 requestorEmail: johndoe@ucsb.edu"

Number of calls: 0

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:40:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/recommendationRequest" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/recommendationRequest"}

Number of calls: 0
