[Killed] StringLiteral
src/main/utils/recommendationrequestUtils.js:10:10
 
 export function cellToAxiosParamsDelete(cell) {
   return {
-    url: "/api/recommendationrequest",
+    url: "",
     method: "DELETE",
     params: {
killedBy: recommendationrequestUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "method": "DELETE",
    "params": Object {
