[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:15:18
 export default function RecommendationRequestTable({
   recommendationrequests,
   currentUser,
-  testIDPrefix = "RecommendationRequestTable",
+  testIDPrefix = "",
 }) {
   const navigate = useNavigate();
killedBy: RecommendationRequestIndexPage tests renders three requests correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/RecommendationRequests/RecommendationRequestTable.js:69:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, testIDPrefix));
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, testIDPrefix),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:72:20
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, testIDPrefix));
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, testIDPrefix),
+      ButtonColumn("", "danger", deleteCallback, testIDPrefix),
     );
   }
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
