[Killed] BlockStatement
main/components/UCSBDates/UCSBDatesTable.js:51:43
       accessor: "localDateTime",
     },
   ];
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "UCSBDatesTable"),
-    );
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "UCSBDatesTable"),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return <OurTable data={dates} columns={columns} testid={"UCSBDatesTable"} />;
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDatesTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
