[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (recommendationRequest) => ({
-    url: "/api/recommendationRequest",
-    method: "PUT",
-    params: {
-      id: recommendationRequest.id,
-    },
-    data: {
-      requestorEmail: recommendationRequest.requestorEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-      explanation: recommendationRequest.explanation,
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "RecommendationRequest Updated - id: 1 requestorEmail: requestor2@gmail.com"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestEditPage.js:44:48
     },
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(
-      `RecommendationRequest Updated - id: ${recommendationRequest.id} requestorEmail: ${recommendationRequest.requestorEmail}`,
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />
