[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestIndexPage.js:12:30
 export default function RecommendationRequestIndexPage() {
   const currentUser = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/recommendationRequest/create"
-          style={{ float: "right" }}
-        >
-          Create RecommendationRequest
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   const {
killedBy: RecommendationRequestIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create RecommendationRequest/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestIndexPage.js:33:15
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/recommendationRequest/all"],
-    { method: "GET", url: "/api/recommendationRequest/all" },
+    { method: "", url: "/api/recommendationRequest/all" },
     [],
   );
killedBy: RecommendationRequestIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/recommendationRequest/all"
Received string:    "Error communicating with backend via  on /api/recommendationRequest/all"

[Killed] ObjectLiteral
main/pages/RecommendationRequest/RecommendationRequestIndexPage.js:33:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/recommendationRequest/all"],
-    { method: "GET", url: "/api/recommendationRequest/all" },
+    {},
     [],
   );
killedBy: RecommendationRequestIndexPage tests renders three requests correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
