[Killed] StringLiteral
src/main/utils/recommendationrequestUtils.js:10:10
 
 export function cellToAxiosParamsDelete(cell) {
   return {
-    url: "/api/recommendationRequest",
+    url: "",
     method: "DELETE",
     params: {
killedBy: RecommendationRequestIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "RecommendationRequest with id 2 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
